<img src="https://www.dropbox.com/scl/fi/43hqdf0m38towzlbjv42f/epsindo-header.jpg?rlkey=u1kbivcdhbf0wpv1fyuqggpnp&st=4vn8xg6k&dl=1" width="1400"/>

# Pra Pelatihan 1: Fundamental Python II
---

### Isi Materi :

1. [Functions & Method](#10)
2. [Working with Pandas & Numpy](#11)
3. [Quiz](#12)

### üìå Ekspektasi Hasil Pembelajaran:
Peserta dapat mengetahui fungsi dan method pada bahasa pemrograman Python, peserta dapat mengetahui dan menggunakan library paket Pandas dan Numpy untuk mengelola data.

*Referensi:*

1. https://belajarpython.com/tutorial/fungsi-python
2. https://www.petanikode.com/python-fungsi/
3. https://petruknisme.com/2019/04/15/pengenalan-pandas-dan-series/
4. https://code.tutsplus.com/id/tutorials/introducing-pandas--cms-26514
5. https://jagongoding.com/python/dasar/fungsi/
6. https://medium.com/@rismitawahyu/function-and-methods-in-python-fungsi-dan-metode-di-python-757204314517
7. https://www.analyticsvidhya.com/blog/2020/11/basic-concepts-object-oriented-programming-types-methods-python/#:~:text=In%20Python%2C%20methods%20are%20functions%20that%20are%20associated,an%20important%20part%20of%20object-oriented%20programming%20in%20Python.
8. https://pythongeeks.org/methods-in-python/
9. https://www.codecademy.com/article/introduction-to-numpy-and-pandas
10. https://medium.com/@prettytambunann/numpy-basic-functionalities-matrix-operstions-ea3fec9274e7
11. https://www.hub.idbigdata.com/sigit-prasetyo/panduan-praktis-penggunaan-pandas-bagian-1-39

<a id="10"></a>
## 1. Functions & Method

### __Pengertian Fungsi (def) Pada Python__

Fungsi pada python adalah kumpulan perintah atau baris kode yang dikelompokkan menjadi satu kesatuan untuk kemudian bisa dipanggil atau digunakan berkali-kali.

Sebuah fungsi bisa menerima parameter, bisa mengembalikan suatu nilai, dan bisa dipanggil berkali-kali secara independen.

Dengan fungsi kita bisa memecah program besar yang kita tulis, menjadi bagian-bagian kecil dengan tugasnya masing-masing.

Juga, fungsi akan membuat kode program kita menjadi lebih ‚Äúreusable‚Äù dan lebih terstruktur.

#### Sintaks Fungsi

Di dalam python, sintaks pembuatan fungsi terlihat seperti berikut:

```python
def nama_fungsi(parameters):
  statements
```

Sintaks di atas secara umum terbagi menjadi 4 bagian:

1. Kata kunci ```def``` yang menjadi pertanda bahwa blok kode program adalah sebuah fungsi

2. Nama fungsi yang kita buat

3. Parameters yang akan diterima oleh fungsi yang kita buat (tidak wajib)

4. Dan blok kode fungsi yang di sana akan kita tulis perintah-perintah yang harus dilakukan oleh sebuah fungsi

Contoh sebuah fungsi sederhana dengan nama ```cetak_nama()```:

In [1]:
def cetak_nama():
  print('Halo semua! Saya Jul!')

cetak_nama()

Halo semua! Saya Jul!


Fungsi di atas, jika dipanggil, akan mengeksekusi perintah ```print()``` yang ada di dalamnya.

#### Memanggil Fungsi

Bagaimana cara memanggil fungsi yang telah kita definisikan?

Sederhana.

Cukup ketik nama fungsinya, ditambah dengan tanda kurung ```()``` seperti berikut:

```cetak_nama()```

Output:

```Halo semua! Saya Jul!```

Bahkan kita bisa memanggil fungsi ```cetak_nama()``` berkali-kali:

```python
cetak_nama()
cetak_nama()
cetak_nama()
```

#### Fungsi dengan Argumen atau Parameter

Sebuah fungsi juga bisa menerima parameter atau pun argumen. Ia merupakan suatu nilai/variabel yang dilemparkan ke dalam fungsi untuk diproses lebih lanjut.

Sebagai contoh, perhatikan output berikut:

```python
Halo semua! Saya Jul!
Halo semua! Saya Ilham!
Halo semua! Saya Radja!
```

Kita dapat memanfaatkan __fungsi dan parameter__ pada Python untuk memberikan nilai yang akan di proses ke dalam fungsi.
Sehingga kode programnya akan terlihat seperti ini:

In [2]:
def cetak_nama(nama):
  print(f'Halo semua! Saya {nama}!')


cetak_nama('Jul')
cetak_nama('Ilham')
cetak_nama('Radja')

Halo semua! Saya Jul!
Halo semua! Saya Ilham!
Halo semua! Saya Radja!

#### Parameter Wajib

Parameter di dalam python bisa lebih dari satu, bisa wajib semua (harus diisi), dan bisa juga bersifat opsional.

Perhatikan contoh fungsi berikut:

```python
def <nama fungsi> (<parameter wajib 1>, <parameter wajib 2>):
  print(f"{parameter wajib 1} {parameter wajib 2}")
```

Contoh, untuk menghitung luas dari persegi panjang dengan menggunakan parameter wajib, seperti berikut:

In [3]:
def luas_persegi_panjang(panjang,lebar):
    luas=panjang*lebar
    print(f'Panjang : {panjang}\nLebar: {lebar}\nLuas dari Persegi Panjangnya adalah {luas}')

luas_persegi_panjang(4,5)

Panjang : 4
Lebar: 5
Luas dari Persegi Panjangnya adalah 20

Output dari kode diatas akan menampilkan keterangan mengenai panjang dan lebar persegi panjang, dan hasil dari luas persegi panjang.

Namun, jika kita memanggil fungsi ```luas_persegi_panjang()``` dengan parameter yang tidak lengkap, akan menyebabkan error:

In [4]:
# Error missing 1 required positional argument: 'lebar'

luas_persegi_panjang(4)

TypeError: luas_persegi_panjang() missing 1 required positional argument: 'lebar'

#### Parameter Opsional (atau Default)

Tidak semua parameter fungsi pada python itu bersifat wajib. Ada yang opsional.

Parameter opsional adalah parameter yang seandainya tidak diisi, dia sudah memiliki nilai default.

Perhatikan contoh berikut:

```python
def nama_fungsi (parameter1, parameter2, parameterOpsional = 'nilai parameter default'):
  print(f"{parameter1} {parameter2} {parameterOpsional}")
```

__Penjelasan:__

Pada fungsi nama_fungsi() di atas, kita mendefinisikan 3 buah parameter:

* parameter1
* parameter2
* parameterOpsional = 'nilai parameter default'

Parameter ```parameter1``` dan ```parameter2``` adalah bersifat wajib dan harus diisi, sedangkan parameter ```parameterOpsional``` tidak wajib. Jika tidak kita isi, maka akan menampilkan nilai parameter default yaitu "nilai parameter default".

Sekarang, mari kita coba panggil fungsi tersebut dengan 2 cara:

In [5]:
def nama_fungsi (parameter1, parameter2, parameterOpsional = 'nilai parameter default'):
  print(f"{parameter1} {parameter2} {parameterOpsional}")

# Memanggil fungsi dengan 2 input parameter
nama_fungsi("Ini Parameter 1", 2)

# Memanggil fungsi dengan 3 input parameter
nama_fungsi("Ini parameter 1", 2, "ini parameter opsionalnya")

Ini Parameter 1 2 nilai parameter default
Ini parameter 1 2 ini parameter opsionalnya

Dapat kita lihat pada output diatas, jika kita tidak memasukan nilai pada parameter opsional, maka tidak akan terjadi error, sebab parameter tersebut memiliki nilai defaultnya.

#### Fungsi Dengan Parameter Tidak Berurut

Jika kita perhatikan lagi fungsi ```nama_fungsi()```, kita akan dapati kalau parameter yang bersifat opsional hanya ada 1, dan hanya ada di belakang.

Tapi, bagaimana jika ternyata parameter opsionalnya ada lebih dari 1?

Coba perhatikan:

In [6]:
def suhu_udara (daerah, derajat = 30, satuan = 'celcius'):
  print(f"Suhu di {daerah} adalah {derajat} {satuan}")

Pada fungsi tersebut, kita telah mengatur nilai default untuk parameter ```derajat```. Sehingga sekarang kita memiliki dua buah parameter.

Kita coba panggil dengan 2 parameter seperti ini:

In [7]:
suhu_udara('Jakarta', 'fahrenheit')

Suhu di Jakarta adalah fahrenheit celcius

Padahal kita inginnya hanya mengisi 2 parameter saja:

1. Satu untuk parameter ```daerah```
2. Dan yang kedua untuk parameter ```satuan```
Tapi di sini malah terisi adalah parameter ```derajat```.

Untuk mengatasi hal ini, kita bisa mendefinisikan nama argumen/parameter yang akan kita isi.

Perhatikan contoh ini:

In [8]:
# Memanggil fungsi tanpa mendefinisikan nilai untuk parameter apa
suhu_udara('Jakarta', 'fahrenheit')

# Memnaggil fungsi dengan mendefinisikan nilai untuk parameter satuan
suhu_udara('Jakarta', satuan = 'fahrenheit')

Suhu di Jakarta adalah fahrenheit celcius
Suhu di Jakarta adalah 30 fahrenheit

Dengan mendefinisikan nama argumen yang kita _passing_, kita sekarang bisa memanggilnya bahkan secara tidak berurutan sekalipun:

In [9]:
suhu_udara(satuan='kelvin', daerah='Makasar', derajat=100)

Suhu di Makasar adalah 100 kelvin

#### Fungsi yang Mengembalikan Nilai

Jenis fungsi yang berikutnya adalah berkaitan dengan nilai kembalian.

Ditinjau dari segi pengembalian nilai, fungsi terbagi menjadi 2:

1. Fungsi yang tidak mengembalikan nilai
2. Fungsi yang mengembalikan nilai

Pada contoh-contoh sebelumnya, kita telah membuat dan memanggil fungsi-fungsi yang tidak memiliki nilai.

Sekarang, kita akan coba membuat fungsi yang mempunyai atau mengembalikan sebuah nilai.

In [10]:
def luas_persegi (sisi):
  return sisi * sisi

Penjelasan

Kata kunci ```return``` berfungsi untuk mengembalikan nilai.
Nilai yang dikembalikan suatu fungsi, bisa kita olah kembali untuk berbagai kebutuhan.

__Contoh:__

In [11]:
# tidak menghasilkan output apa pun
luas_persegi(10)

# menghasilkan output
print('Luas persegi dengan sisi 4 adalah:', luas_persegi(4))

# kita juga bisa simpan di dalam variabel
persegi_besar = luas_persegi(100)
persegi_kecil = luas_persegi(50)

print('Toal luas persegi besar dan kecil adalah:', persegi_besar + persegi_kecil)

Luas persegi dengan sisi 4 adalah: 16
Toal luas persegi besar dan kecil adalah: 12500

fungsi yang __mengembalikan nilai__ adalah sebuah fungsi yang jika kita panggil, dia akan __memberikan kita sebuah nilai yang bisa kita olah lebih lanjut__, seperti misalkan kita simpan dalam sebuah variabel atau kita lakukan operasi tertentu.

#### Lebih dari 1 return

Jika statement ```return``` telah dieksekusi pada sebuah fungsi, maka semua proses yang ada di dalam blok kode fungsi tersebut akan berhenti.

Sehingga, misalkan kita memiliki lebih dari 1 buah ```return```, maka hanya ada satu ```return``` saja yang dieksekusi. Dan ketika sebuah ```return``` telah dieksekusi, semua perintah yang ada di bawahnya akan di-skip ‚Äìini mirip dengan perintah break pada perulangan ```for``` mau pun ```while```.

Perhatikan contoh berikut:

In [12]:
def persentase (total, jumlah):
  if (total >= 0 and total <= jumlah):
    return total / jumlah * 100
  
  return False

# output 50
print(persentase(30, 60))

# output False
print(persentase(100, 60))

50.0
False

#### Variabel Global dan Lokal pada Python

Saat kita menggunakan fungsi, maka kita juga harus mengetahui yang namanya variabel Global dan Lokal.

__Apa itu?__

Variabel Global adalah variabel yang bisa diakses dari semua fungsi, sedangkan variabel lokal hanya bisa diakses di dalam fungsi tempat ia berada saja.

Pada Python, urutan pengaksesan variabel (scope) dikenal dengan sebutan LGB (Local, Global, dan Build-in).

Jadi program python mulai mencari variabel lokal terlebih dahulu, kalau ada maka itu yang digunakan.

Tapi kalau tidak ada, pencarian terus ke Global, dan Build-in.

Variabel Build-in adalah variabel yang sudah ada di dalam Python.

__Contoh program:__

In [112]:
# membuat variabel global
nama = "Alvin Steven"
versi = "1.0.0"

def baru():
    # ini variabel lokal
    nama = "Radja Djata"
    versi = "1.0.2"
    # mengakses variabel lokal
    print("Nama: %s" % nama)
    print("Versi: %s" % versi)


# mengakses variabel global
print("Nama: %s" % nama)
print("Versi: %s" % versi)

# memanggil fungsi baru()
baru()

Nama: Alvin Steven
Versi: 1.0.0
Nama: Radja Djata
Versi: 1.0.2

Perhatikanlah variabel nama yang berada di dalam fungsi ```baru()``` dan di luar fungsi ```baru()```.

Variabel nama yang berada di dalam fungsi ```baru()``` adalah variabel lokal.

Jadi, saat kita memanggil fungsi ```baru()``` maka nilai yang akan tampil adalah nilai yang ada di dalam fungsi ```baru()```.

Kenapa tidak tampil yang global?

Karena itu tadi‚Ä¶

Python mulai mencari dari lokal, ke global, dan build-in.

Kalau di tiga tempat itu tidak ditemukan, maka biasanya akan terjadi ```NameError``` atau variabel tidak ditemukan.

---

### __Method dalam Python__

#### Apa itu Metode?

Method adalah salah satu hal yang sangat penting dalam python. Fungsi yang dimiliki oleh suatu object dinamakan method. Contohnya kita membuat variabel bertipe string, bertipe list, bertipe numeric dan lain sebagainya, itu semua adalah object, dan setiap object memiki fungsi yang hanya bisa digunakan oleh object tersebut.

Contoh sederhana:

* Fungsi adalah blok kode yang dapat dipanggil untuk melakukan tugas tertentu.
* Metode adalah fungsi yang terikat pada objek atau kelas.

__Struktur umum Method:__

```object.method_name(arguments)```

---
#### Metode pada tipe data Built-in

Python memiliki banyak metode built-in yang dapat digunakan untuk berbagai tipe data. Berikut adalah beberapa contoh metode yang sering digunakan pada tipe data string, list, dan dictionary.

__Metode pada String__

Tipe data string memiliki banyak metode yang bisa digunakan untuk memanipulasi atau memeriksa teks. Berikut beberapa contoh metode pada string:

* ```upper()```: Mengubah semua huruf dalam string menjadi huruf besar.

```python
text = "hello"
print(text.upper())  # Output: "HELLO"
```

* ```lower()``` : Mengubah semua huruf dalam string menjadi huruf kecil.

```python
text = "HELLO"
print(text.lower())  # Output: "hello"
```

* ```strip()```: Menghapus spasi di awal dan akhir string.

```python
text = "  hello  "
print(text.strip())  # Output: "hello"
```

Berikut adalah tabel metode yang dimiliki oleh tipe data string beserta penjelasan singkat tentang fungsinya:


| **Metode**              | **Deskripsi**                                                                 |
|-------------------------|-------------------------------------------------------------------------------|
| `str.lower()`           | Mengembalikan salinan string dengan semua karakter dalam huruf kecil.        |
| `str.upper()`           | Mengembalikan salinan string dengan semua karakter dalam huruf besar.        |
| `str.title()`           | Mengembalikan salinan string dengan huruf pertama setiap kata diubah ke besar.|
| `str.capitalize()`      | Mengubah huruf pertama menjadi besar dan huruf lainnya menjadi kecil.        |
| `str.strip()`           | Menghapus spasi atau karakter tertentu dari awal dan akhir string.           |
| `str.lstrip()`          | Menghapus spasi atau karakter tertentu dari awal string.                     |
| `str.rstrip()`          | Menghapus spasi atau karakter tertentu dari akhir string.                    |
| `str.replace(old, new)` | Mengganti semua kemunculan substring `old` dengan `new` dalam string.        |
| `str.find(sub)`         | Mengembalikan indeks pertama kemunculan substring `sub` atau -1 jika tidak ditemukan. |
| `str.rfind(sub)`        | Mengembalikan indeks kemunculan terakhir substring `sub` atau -1 jika tidak ditemukan. |
| `str.split(sep)`        | Memisahkan string menjadi daftar berdasarkan delimiter `sep`.                |
| `str.join(iterable)`    | Menggabungkan elemen-elemen dari iterable menjadi satu string, dengan separator string asli. |
| `str.count(sub)`        | Menghitung jumlah kemunculan substring `sub` dalam string.                   |
| `str.startswith(prefix)`| Mengecek apakah string dimulai dengan substring `prefix`.                    |
| `str.endswith(suffix)`  | Mengecek apakah string diakhiri dengan substring `suffix`.                   |
| `str.isalpha()`         | Mengecek apakah semua karakter dalam string adalah huruf (a-z, A-Z).        |
| `str.isdigit()`         | Mengecek apakah semua karakter dalam string adalah digit numerik.           |
| `str.isalnum()`         | Mengecek apakah semua karakter dalam string adalah alphanumeric (huruf dan angka). |
| `str.islower()`         | Mengecek apakah semua karakter dalam string adalah huruf kecil.             |
| `str.isupper()`         | Mengecek apakah semua karakter dalam string adalah huruf besar.             |
| `str.swapcase()`        | Mengubah huruf besar menjadi kecil dan sebaliknya dalam string.              |
| `str.zfill(width)`      | Mengisi string dengan nol di sebelah kiri hingga panjang `width`.             |
| `str.format(*args, **kwargs)` | Menggunakan string format untuk menggantikan placeholder dengan nilai yang diberikan. |

---
__Metode pada List__

Tipe data list juga memiliki berbagai metode untuk mengelola koleksi data. Berikut adalah beberapa contoh metode pada list:

* ```append(item)```: Menambahkan item ke akhir list.

```python
my_list = [1, 2, 3]
my_list.append(4)
print(my_list)  # Output: [1, 2, 3, 4]
```

* ```remove(item)```: Menghapus item pertama yang ditemukan dalam list.

```python
my_list = [1, 2, 3, 4]
my_list.remove(3)
print(my_list)  # Output: [1, 2, 4]
```

* ```sort()```: Mengurutkan elemen dalam list.

```python
my_list = [3, 1, 2]
my_list.sort()
print(my_list)  # Output: [1, 2, 3]
```
Berikut adalah tabel metode yang dimiliki oleh tipe data list beserta penjelasan singkat mengenai fungsinya:

| **Metode**               | **Deskripsi**                                                                 |
|--------------------------|-------------------------------------------------------------------------------|
| `append(item)`           | Menambahkan item ke akhir list.                                               |
| `extend(iterable)`       | Menambahkan elemen-elemen dari iterable (list, tuple, dll.) ke dalam list.   |
| `insert(index, item)`    | Menyisipkan item pada posisi yang ditentukan oleh index.                     |
| `remove(item)`           | Menghapus item pertama yang ditemukan dalam list.                            |
| `pop([index])`           | Menghapus dan mengembalikan elemen pada posisi yang ditentukan oleh index (default adalah elemen terakhir). |
| `clear()`                | Menghapus semua elemen dari list.                                            |
| `index(item)`            | Mengembalikan indeks pertama dari item yang ditemukan dalam list.            |
| `count(item)`            | Menghitung jumlah kemunculan item dalam list.                                |
| `sort(reverse=False, key=None)` | Mengurutkan elemen-elemen dalam list. Opsi `reverse=True` untuk urutan terbalik dan `key` untuk kriteria pengurutan. |
| `reverse()`              | Membalik urutan elemen dalam list.                                           |
| `copy()`                 | Membuat salinan (shallow copy) dari list.                                    |

---
__Metode pada Integer__

Meskipun tipe data integer tidak memiliki metode spesifik yang dapat dipanggil seperti tipe data string atau list, Python menyediakan berbagai fungsi built-in yang sangat berguna.

Berikut adalah beberapa contoh penggunaan metode dan operasi pada tipe data ```integer``` di Python:

* ```abs(x)```: Mengambil nilai absolut

```python
x = -10
result = abs(x)
print(result)  # Output: 10
```
* ```pow(x, y)```: Menghitung pangkat

```python
x = 2
y = 3
result = pow(x, y)
print(result)  # Output: 8 (2^3 = 8)
```
* ```divmod(a, b)```: Membagi dan mendapatkan hasil bagi serta sisa

```python
Copy code
a = 17
b = 5
result = divmod(a, b)
print(result)  # Output: (3, 2) -> 17 dibagi 5 hasilnya 3 dengan sisa 2
```

Berikut adalah tabel metode dan fungsi yang dapat digunakan pada tipe data integer di Python:

| Fungsi/Operasi    | Deskripsi                                                                 |
|-------------------|---------------------------------------------------------------------------|
| `abs(x)`          | Mengembalikan nilai absolut dari `x` (menghilangkan tanda negatif).      |
| `pow(x, y)`       | Menghitung `x` pangkat `y`.                                                |
| `divmod(a, b)`    | Mengembalikan tuple (hasil bagi, sisa) dari pembagian `a` dengan `b`.     |
| `int(x)`          | Mengonversi `x` menjadi integer.                                           |
| `bin(x)`          | Mengonversi `x` menjadi representasi biner (string).                       |
| `hex(x)`          | Mengonversi `x` menjadi representasi heksadesimal (string).                |
| `oct(x)`          | Mengonversi `x` menjadi representasi oktal (string).                       |
| `+`               | Operasi penjumlahan antara dua integer.                                    |
| `-`               | Operasi pengurangan antara dua integer.                                   |
| `*`               | Operasi perkalian antara dua integer.                                     |
| `/`               | Operasi pembagian antara dua integer (hasil float).                        |
| `//`              | Operasi pembagian bulat antara dua integer (hasil integer).               |
| `%`               | Mengembalikan sisa bagi antara dua integer.                                |
| `**`              | Operasi perpangkatan integer (`x**y`).                                     |

---
### __Membuat Method di Python__

Kita dapat mendefinisikan method dengan menggunakan kata kunci ```def``` dan sintaks dasar method seperti ini:

```python
class ClassName:
   def method_name(*args):
       # Statements..
```

Dengan menggunakan sintaks diatas, kita dapat membuat method, tetapi sebelumnya mari kita coba membuat ```class``` untuk method kita.

In [14]:
class Student:
   pass

student1 = Student()
print(f"Object Created: {student1}")

Object Created: <__main__.Student object at 0x7f63f9701f50>

Pada kode diatas, kita berhasil membuat ```class``` kosong dan sebuah objek untuk mengakses ```class``` tersebut. Objek yang kita buat, tidak memiliki fungsional. Untuk memberi fungsionalitas pada ```class``` kosong, kita dapat mendefinisikan method.

In [15]:
class Student:

   def study(self):
       return "Student is studying..."

student1 = Student()
print(f"Object Created: {student1}")

Object Created: <__main__.Student object at 0x7f63f97003d0>

Pada kode diatas, kita telah membuat method ```study()``` pada class ```Student```.
Sekarang objek pada ```class``` kita telah memiliki fungsionalitas, tetapi bagaimana cara mengakses method nya ?

---
### __Mengakses Method di Python__

Kita dapat mengakses method seperti sebuah atribut dengan menggunakan operator dot dan baik itu nama objek atau nama ```class``` tergantung pada tipe methodnya.

__Sintaks:__

```object_name.method_name(*args)```

atau

```ClassName.method_name(*args)```

Contoh, kita akan mencoba mengakses method ```study()``` yang sebelumnya telah berhasil kita buat.

In [16]:
# Mengakses Method di Python

print(student1.study())

Student is studying...

---
<a id="11"></a>
## 2. Pandas & Numpy üöÄ

Pandas dan NumPy adalah dua pustaka utama dalam ekosistem Python untuk analisis data dan komputasi numerik.

* __NumPy__ digunakan untuk operasi berbasis array/matriks dengan performa tinggi.
* __Pandas__ digunakan untuk manipulasi dan analisis data berbasis tabel (DataFrame).

---
### __NumPy: Dasar-Dasar dan Contoh Penggunaan__

NumPy (*Numerical Python*) adalah library Python yang fokus pada *scientific computing*. NumPy memiliki kemampuan untuk membentuk objek N-dimensional array, yang mirip dengan list pada Python. Keunggulan NumPy array dibandingkan dengan list pada Python adalah konsumsi memory yang lebih kecil serta runtime yang lebih cepat. NumPy juga memudahkan kita pada Aljabar Linear, terutama operasi pada Vector (1-d array) dan Matrix (2-d array).

#### __Instalasi Numpy__
Sebelum menggunakan NumPy, pastikan sudah terinstall. Jika belum, instal dengan:

```pip install numpy```

List pada Python tidak mendukung penuh kemudahan scientific computing, sebagai contoh kita akan lakukan operasi penjumlahan pada 2 list.

In [17]:
# List pada python
a = [1, 2, 3]
b = [4, 5, 6]

print(a+b)

[1, 2, 3, 4, 5, 6]

In [18]:
# Penjumlahan dilakukan iterasi
result = []
for satu,dua in zip(a,b):
    result.append(satu+dua)
result

[5, 7, 9]

Ketika kita ingin menjumlahkan tiap elemen pada list a dan list b, hasilnya dengan operator + adalah penggabungan (concat) keduanya. Tentu tidak sesuai yang diharapkan, maka kita harus menggunakan perulangan for untuk menambahkan tiap elemen pada list a dan list b. Proses penjumlahan list yang menggunakan perulangan for membutuhkan waktu yang lama dan tidak efisien dari sisi penulisan code.

#### __Pengenalan NumPy Arrays__

__Membuat Array__

Lakukan import terlebih dahulu library numpy as np. Penggunaan as disini, artinya kita menggantikan pemanggilan numpy dengan prefix np untuk proses berikutnya.

In [19]:
import numpy as np

In [20]:
a = np.array([1,2,3])
a

array([1, 2, 3])

Untuk membuat sebuah array, kita menggunakan fungsi array() yang terdapat pada NumPy. Pada NumPy, terdapat upcasting, yaitu ketika tipe data element array tidak sama, dilakukan penyamaan tipe data pada yang lebih tinggi. Misalkan kita membuat array numeric dengan semua element bertipe integer, kecuali 1 element bertipe float, maka otomatis akan dilakukan upcasting menjadi tipe float pada semua element array.

__Cek Tipe Data__

Untuk melakukan pengecekan tipe pada array menggunakan fungsi type().

In [21]:
# melakukan pemeriksaan tipe data array
type(a)

numpy.ndarray

NumPy array merupakan sebuah objek ndarray, yang merupakan singkatan dari n-dimensional array.

__Tipe Data untuk Element__

Pengecekan tipe data element pada array menggunakan fungsi dtype.

In [22]:
a.dtype

dtype('int64')

__Jumlah Dimensi__

NumPy array memiliki keunggulan mendukung operasi pada data dimensional seperti Vektor dan Matriks. Untuk mengetahui jumlah dimensi pada data menggunakan fungsi ndim.

In [23]:
a.ndim

1

Array a memiliki jumlah dimensi 1. Jika kita membentuk array dengan 2-dimensi, maka jumlah dimensinya adalah 2, begitu juga dengan dimensi yang lebih besar.

__Array Shape__

Pada fungsi shape menghasilkan sebuah tuple yang berisikan panjang sebuah array pada tiap dimensi.

In [24]:
a.shape

(3,)

Array a memiliki shape 3, yaitu panjang array pada 1-dimensi array.

__Operasi pada Array__

NumPy memudahkan kita untuk operasi elementwise pada Vektor dan Matriks seperti penjumlahan, perkalian, pangkat, dan operasi lainnya.

In [25]:
a = np.array([1,2,3])
b = np.array([1.1,2.2,3.3])

print(a+b)

[2.1 4.2 6.3]

In [26]:
a*b

array([1.1, 4.4, 9.9])

In [27]:
a**b

array([ 1.        ,  4.59479342, 37.5405076 ])

In [28]:
# universal function pada numpy seperti sin
np.sin(a)

array([0.84147098, 0.90929743, 0.14112001])

Pada NumPy telah disediakan universal functions (ufunc) yaitu fungsi yang dapat melakukan operasi pada NumPy array dengan eksekusi elemen-demi-elemen. ufunc merupakan sebuah 'vectorized' wrapper untuk sebuah fungsi yang memiliki input dan output yang sepesifik. Contoh dari ufunc misalkan fungsi sin dan cos.

#### __Element pada Array__
__Array Indexing__

Indeks pada suatu array dimulai pada indeks ke-0. Untuk mengakses element pada array, kita menggunakan indeks sebagai alamat elemen pada array.

In [29]:
# mengakses elemen pada indeks ke-0
a = ([1,2,3])
a[0]

1

In [30]:
# melakukan assign pada element array dengan element baru
a[0]=5
a

[5, 2, 3]

Kita dapat melakukan assign nilai baru pada suatu element berdasarkan alamat indeks. Maka, setelah dilakukan assign nilai element pada indeks ke-0 berganti menjadi 10.

Perlu kita perhatikan jika dtype pada array adalah integer, misalkan int32. Kemudian kita assign nilai baru pada salah satu elemen dengan tipe data float. Maka, nilai baru tersebut akan dipaksa menjadi tipe int32 sesuai dengan tipe data pada array.

In [31]:
a = np.array([1,2,3])
a.dtype

dtype('int64')

In [32]:
# Assign nilai baru pada indeks ke-0
a[0] = 4.5
a

array([4, 2, 3])

__Multi-Dimensional Arrays__

NumPy array memudahkan kita untuk membuat array multi-dimensi.

<center>
    <img src="../assets/numpy.png" alt="Multi-Dimensional Arrays" width="200"/>
</center>

In [33]:
a = np.array([[0,1,2,3],
             [10,11,12,13]])
print(a)

[[ 0  1  2  3]
 [10 11 12 13]]

Fungsi shape pada array multi-dimensi menghasilkan tuple berisikan (jumlah baris, jumlah kolom).
<center>
    <img src="../assets/num2.png" alt="Multi-Dimensional Arrays2" width="300"/>
</center>

In [34]:
a.shape

(2, 4)

Untuk mengetahui jumlah elemen pada array multi-dimensi menggunakan fungsi __size__.
<center>
    <img src="../assets/num3.png" alt="Multi-Dimensional Arrays2" width="300"/>
</center>

In [35]:
a.size

8

Untuk mengetahui jumlah dimensi dari array multi-dimensi menggunakan fungsi __ndim__. Jumlah dimensi pada array a adalah 2, karena merupakan array 2-dimensi.

In [36]:
a.ndim

2

Pada array multi-dimensi kita dapat mengakses nilai elemen berdasarkan indeks dengan pemisah tanda koma __[,]__. Misalkan kita ingin mendapatkan data pada baris ke-1 dan kolom ke-2 dari array a, maka dilakukan perintah __a[1, 2]__.

In [39]:
a[1,2]

12

Misalkan, kita akan mengganti data pada baris ke-1 dan kolom ke-3 pada array a dengan nilai -1, kita dapat langsung assign nilai baru tersebut pada indeks.
<center>
    <img src="../assets/num4.png" alt="Multi-Dimensional Arrays2" width="300"/>
</center>

In [40]:
a[1,3] = -1
a

array([[ 0,  1,  2,  3],
       [10, 11, 12, -1]])

#### __Slicing__

Selain kita dapat mengambil sebuah element array dengan cara indexing seperti cara di atas, kita dapat melakukan slicing, yaitu melakukan ekstraksi elemen atau beberapa elemen pada array, dengan menggunakan tanda __[:]__.

```var[Start:Stop:step]```

Perlu kita perhatikan, elemen pada lower akan dimasukkan hasil slicing, sedangkan element pada upper TIDAK dimasukkan hasil slicing, dan step adalah jarak antar elemen.

In [54]:
# SLicing dari indeks ke-1, dan batas indeks ke-2
a = np.array([1,2,3,4,5,6,7,8,9])

a[1:2]

array([2])

In [52]:
# Slicing dari indeks ke-1, dan batas indeks ke-1 dari belakang
a[1:-1]

array([2, 3, 4, 5, 6, 7, 8])

In [53]:
# kosong ‚Üí mulai dari indeks pertama.
# stop kosong ‚Üí berlanjut sampai akhir list.
# step = 2 ‚Üí mengambil setiap elemen ke-2.
a[::2]

array([1, 3, 5, 7, 9])

#### __Pengenalan Pandas__

Pandas adalah pustaka Python yang digunakan untuk manipulasi dan analisis data.
Pandas menyediakan dua struktur data utama:

1. **Series** - Struktur data satu dimensi seperti array atau list.
2. **DataFrame** - Struktur data dua dimensi seperti tabel atau spreadsheet.

Mari kita mulai dengan mengenal Pandas!

## 1. Instalasi dan Import

Jika belum terinstal, jalankan:

```python
pip install pandas
```

Untuk menggunakan paket pandas kita harus melakukan import paket, dan memberikan nama yang lebih pendek seperti pd, dengan menggunakan perintah __import as__.

In [99]:
import pandas as pd
print('Pandas version: {}'.format(pd.__version__))

Pandas version: 2.2.2

## __Dataset__

Dataset yang akan digunakan adalah dataset yang sederhana, sehingga lebih mudah untuk memahami Pandas. Data diambil dari Badan Pusat Statistik (bps.go.id). Dataset tersebut memuat beberapa informasi tentang provinsi di Indonesia pada tahun 2015. Dataset ini memiliki 10 kolom:

1. __province__: nama provinsi di Indonesia
2. __rainfall__: jumah curah hujan dalam mm yang diambil dari stasiun pengamatan yang dimiliki BMKG
3. __rainy_day__: jumlah hari terjadinya hujan dalam setahun
4. __expenses_food_urban__: rata-rata pengeluaran perkapita dalam sebulan untuk makanan di perkotaan
5. __expenses_other_urban__: rata-rata pengeluaran perkapita dalam sebulan untuk barang non makanan di perkotaan
6. __expenses_food_rural__: rata-rata pengeluaran perkapita dalam sebulan untuk makanan di pedesaan
7. __expense_other_rural__: rata-rata pengeluaran perkapita dalam sebulan untuk barang non makanan di pedesaan
8. __unemployment__: persentase angka pengangguran bulan agustus
9. __time_zone__: klasifikasi zona waktu
10. __island__: nama pulau

### __Membaca File csv__

Dataset yang digunakan adalah data-provinsi-2015 dataset yang telah dijelaskan sebelumnya dan berada pada github.com/project303/dataset. File dataset ini memiliki format text dengan tab sebagai pemisah antar kolom dan memiliki header sebagai nama dari kolom.

Untuk membaca text file dengan delimiter menggunakan perintah __read_csv()__.

In [ ]:
# read csv dari lokal files:
df_test = pd.read_csv("../assets/cloth_data.csv")
df_test.head()

   weight   age  height size
0      62  28.0  172.72   XL
1      59  36.0  167.64    L
2      61  34.0  165.10    M
3      65  27.0  175.26    L
4      62  45.0  172.72    M

In [58]:
# read csv dari URL:
url = "https://raw.githubusercontent.com/project303/dataset/master/data-province-2015.cvs"
df = pd.read_csv(url, sep='\t')

### __Sample Data__

Setelah berhasil diload ke dalam Pandas DataFrame, hal pertama yang biasa dilakukan adalah melihat contoh. Pandas menyediakan perintah ```head()``` untuk melihat 5 baris pertama dari DataFrame.

In [59]:
df.head()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
0,Aceh,1575.0,146,466355,529945,395136,260183,9.93,1,Sumatera
1,Sumatera Utara,975.9,105,416073,453609,413087,269407,6.71,1,Sumatera
2,Sumatera Barat,3548.0,185,509609,578890,447944,319143,6.89,1,Sumatera
3,Riau,2048.3,140,530836,661673,472756,413929,7.83,1,Sumatera
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera

Untuk melihat lebih banyak data, perintah head dapat diberi parameter jumlah dataframe yang ingin ditampilkan. Sebagai contoh untuk menampilkan 10 records pertama dari DataFrame.

In [60]:
df.head(10)

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
0,Aceh,1575.0,146,466355,529945,395136,260183,9.93,1,Sumatera
1,Sumatera Utara,975.9,105,416073,453609,413087,269407,6.71,1,Sumatera
2,Sumatera Barat,3548.0,185,509609,578890,447944,319143,6.89,1,Sumatera
3,Riau,2048.3,140,530836,661673,472756,413929,7.83,1,Sumatera
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera
5,Sumatera Selatan,1947.2,138,418794,514708,358391,260923,6.07,1,Sumatera
6,Bengkulu,2668.9,166,434462,555949,403723,326656,4.91,1,Sumatera
7,Lampung,1628.1,151,447587,538560,359111,294748,5.14,1,Sumatera
8,Kepulauan Bangka Belitung,1534.7,163,606905,613072,551553,467700,6.29,1,Bangka Belitung
9,Kepulauan Riau,2250.9,174,625859,809066,480875,404211,6.20,1,Riau

Untuk menampilkan n record terakhir, dapat menggunakan perintah ```tail(n)```. Jika tidak diberi parameter jumlah recordnya, maka secara default akan menampilkan 5 record

In [61]:
df.tail()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
29,Sulawesi Barat,1167.9,93,367632,369746,321635,263154,3.35,2,Sulawesi
30,Maluku,1987.2,167,486374,511825,378946,285648,9.93,3,Maluku
31,Maluku Utara,913.4,127,465188,510105,404776,315800,6.05,3,Maluku
32,Papua Barat,2844.6,218,593203,676879,463880,420440,8.08,3,Papua
33,Papua,1265.9,168,666922,739704,403652,218261,3.99,3,Papua

Fungsi ```sample()``` pada Pandas dapat digunakan jika kita ingin menampilkan dataframe secara acak. Misalkan menampilkan 10 dataframe secara acak.

In [62]:
df.sample(10)

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
2,Sumatera Barat,3548.0,185,509609,578890,447944,319143,6.89,1,Sumatera
26,Sulawesi Selatan,3382.0,155,436956,575266,312799,275628,5.95,2,Sulawesi
31,Maluku Utara,913.4,127,465188,510105,404776,315800,6.05,3,Maluku
1,Sumatera Utara,975.9,105,416073,453609,413087,269407,6.71,1,Sumatera
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera
5,Sumatera Selatan,1947.2,138,418794,514708,358391,260923,6.07,1,Sumatera
33,Papua,1265.9,168,666922,739704,403652,218261,3.99,3,Papua
29,Sulawesi Barat,1167.9,93,367632,369746,321635,263154,3.35,2,Sulawesi
32,Papua Barat,2844.6,218,593203,676879,463880,420440,8.08,3,Papua

Jika ingin menampilkan seluruh data yang ada dalam DataFrame.

In [63]:
df

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
0,Aceh,1575.0,146,466355,529945,395136,260183,9.93,1,Sumatera
1,Sumatera Utara,975.9,105,416073,453609,413087,269407,6.71,1,Sumatera
2,Sumatera Barat,3548.0,185,509609,578890,447944,319143,6.89,1,Sumatera
3,Riau,2048.3,140,530836,661673,472756,413929,7.83,1,Sumatera
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera
5,Sumatera Selatan,1947.2,138,418794,514708,358391,260923,6.07,1,Sumatera
6,Bengkulu,2668.9,166,434462,555949,403723,326656,4.91,1,Sumatera
7,Lampung,1628.1,151,447587,538560,359111,294748,5.14,1,Sumatera
8,Kepulauan Bangka Belitung,1534.7,163,606905,613072,551553,467700,6.29,1,Bangka Belitung
9,Kepulauan Riau,2250.9,174,625859,809066,480875,404211,6.20,1,Riau
10,DKI Jakarta,2169.5,121,615486,1157945,-,-,7.23,1,Jawa
11,Jawa Barat,2199.3,177,448748,566242,378794,274900,8.72,1,Jawa
12,Jawa Tengah,1620.7,140,350517,468198,313724,277509,4.99,1,Jawa
13,DI Yogyakarta,2045.5,119,385061,697510,325188,297594,4.07,1,Jawa
14,Jawa Timur,2024.7,133,427218,604896,338325,306017,4.47,1,Jawa
15,Banten,1310.1,155,526737,677002,392046,272081,9.55,1,Jawa
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali
17,Nusa Tenggara Barat,1147.9,91,373402,381980,341583,263291,5.69,2,Nusa Tenggara
18,Nusa Tenggara Timur,1406.0,82,401053,473374,272347,176028,3.83,2,Nusa Tenggara
19,Kalimantan Barat,2757.7,215,473082,526121,405835,282118,5.15,1,Kalimantan
20,Kalimantan Tengah,2748.4,155,506106,549096,489011,361909,4.54,1,Kalimantan
21,Kalimantan Selatan,2509.6,166,510837,670407,440745,349861,4.92,2,Kalimantan
22,Kalimantan Timur,2069.4,186,580661,736387,496104,487665,7.50,2,Kalimantan
23,Kalimantan Utara,2311.5,202,536894,623024,478792,419632,5.68,2,Kalimantan
24,Sulawesi Utara,1807.0,127,459988,519694,398016,288894,9.03,2,Sulawesi
25,Sulawesi Tengah,460.9,68,429317,629817,368439,293645,4.10,2,Sulawesi
26,Sulawesi Selatan,3382.0,155,436956,575266,312799,275628,5.95,2,Sulawesi
27,Sulawesi Tenggara,1589.6,141,385082,520583,306600,272945,5.55,2,Sulawesi
28,Gorontalo,870.6,76,400853,541711,287010,234180,4.65,2,Sulawesi
29,Sulawesi Barat,1167.9,93,367632,369746,321635,263154,3.35,2,Sulawesi
30,Maluku,1987.2,167,486374,511825,378946,285648,9.93,3,Maluku
31,Maluku Utara,913.4,127,465188,510105,404776,315800,6.05,3,Maluku
32,Papua Barat,2844.6,218,593203,676879,463880,420440,8.08,3,Papua
33,Papua,1265.9,168,666922,739704,403652,218261,3.99,3,Papua

### __Jumlah Data__

Untuk memperoleh informasi jumlah records pada setiap kolom menggunakan perintah ```count()```

In [64]:
df.count()

province                34
rainfall                34
rainy_day               34
expenses_food_urban     34
expenses_other_urban    34
expenses_food_rural     34
expense_other_rural     34
unemployment            34
time_zone               34
island                  34
dtype: int64

Fungsi ```count()``` akan menampilkan nama kolom dan jumlah baris/record. Seperti yang ditampilkan, semua kolom memiliki jumlah record yang sama, yaitu 34. Ini juga berarti bahwa tidak ada nilai null di semua kolom.

Cara lain untuk menampilkan jumlah record adalah dengan menggunakan property __shape__.

In [65]:
df.shape[0]

34

### __Informasi Struktur Data__

Property shape dapat digunakan untuk mengetahui dimensi dari dataframe

In [66]:
df.shape

(34, 10)

Property DataFrame lainnya adalah dtypes, yang dapat digunakan untuk melihat struktur dari data

In [67]:
df.dtypes

province                 object
rainfall                float64
rainy_day                 int64
expenses_food_urban       int64
expenses_other_urban      int64
expenses_food_rural      object
expense_other_rural      object
unemployment            float64
time_zone                 int64
island                   object
dtype: object

Informasi lebih detail mengenai struktur DataFrame dapat dilihat menggunakan fungsi info()

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   province              34 non-null     object
 1   rainfall              34 non-null     float64
 2   rainy_day             34 non-null     int64
 3   expenses_food_urban   34 non-null     int64
 4   expenses_other_urban  34 non-null     int64
 5   expenses_food_rural   34 non-null     object
 6   expense_other_rural   34 non-null     object
 7   unemployment          34 non-null     float64
 8   time_zone             34 non-null     int64
 9   island                34 non-null     object
dtypes: float64(2), int64(4), object(4)
memory usage: 2.8+ KB

### __Informasi Statistik__

Informasi statistik untuk setiap kolom seperti nilai minimum, nilai maksimum, standar deviasi, rata-rata dan sebagainya, dapat ditampilkan dengan mengikuti perintah berikut

In [69]:
df.describe(include='all')

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
count,34,34.000000,34.000000,34.000000,3.400000e+01,34,34,34.000000,34.000000,34
unique,34,NaN,NaN,NaN,NaN,34,34,NaN,NaN,10
top,Aceh,NaN,NaN,NaN,NaN,395136,260183,NaN,NaN,Sumatera
freq,1,NaN,NaN,NaN,NaN,1,1,NaN,NaN,8
mean,NaN,1871.032353,144.382353,476174.176471,5.963873e+05,NaN,NaN,5.980000,1.588235,NaN
std,NaN,716.155671,37.232289,81025.864223,1.415057e+05,NaN,NaN,1.957125,0.701412,NaN
min,NaN,460.900000,68.000000,350517.000000,3.697460e+05,NaN,NaN,1.990000,1.000000,NaN
25%,NaN,1334.075000,124.750000,420900.000000,5.199162e+05,NaN,NaN,4.567500,1.000000,NaN
50%,NaN,1877.100000,143.500000,462096.000000,5.613845e+05,NaN,NaN,5.685000,1.000000,NaN
75%,NaN,2238.000000,166.750000,522762.000000,6.682235e+05,NaN,NaN,7.145000,2.000000,NaN
max,NaN,3548.000000,218.000000,666922.000000,1.157945e+06,NaN,NaN,9.930000,3.000000,NaN

### __Menampilkan Kolom__

Kita dapat memilih kolom mana saja yang akan ditampilkan, yaitu dengan menyebutkan nama kolom yang akan ditampilkan. Sebagai contoh kita hanya ingin menampilkan kolom __province, unemployment__ dan __expenses_food_urban__

In [70]:
df[['province', 'unemployment', 'expenses_food_urban']].head()

         province  unemployment  expenses_food_urban
0            Aceh          9.93               466355
1  Sumatera Utara          6.71               416073
2  Sumatera Barat          6.89               509609
3            Riau          7.83               530836
4           Jambi          4.34               464204

### __Memfilter Data__

Salah satu bagian penting yang digunakan dalam penyiapan data dan analisis data adalah filtering, yaitu pemilihan data dengan kriteria tertentu. Ini juga disebut data subset.

Bagi mereka yang terbiasa menggunakan SQL, ini adalah bagian dari pernyataan __WHERE__.

Misalnya, kami ingin menampilkan data untuk pulau yang sama dengan __'Sumatera'__

In [71]:
df[(df.island == "Sumatera")].head()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
0,Aceh,1575.0,146,466355,529945,395136,260183,9.93,1,Sumatera
1,Sumatera Utara,975.9,105,416073,453609,413087,269407,6.71,1,Sumatera
2,Sumatera Barat,3548.0,185,509609,578890,447944,319143,6.89,1,Sumatera
3,Riau,2048.3,140,530836,661673,472756,413929,7.83,1,Sumatera
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera

Penggabungkan beberapa kondisi dapat menggunakan operator logika __AND("&")__ dan operator logika __OR("|")__ untuk memilih baris dengan lebih dari satu kriteria.

Misalnya kita ingin menampilkan semua provinsi yang ada di pulau Sumatera dan tingkat pengangguran kurang dari 5.

In [72]:
df[(df.island == "Sumatera") & (df.unemployment < 5)]

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera
6,Bengkulu,2668.9,166,434462,555949,403723,326656,4.91,1,Sumatera

Penulisan dengan cara yang berbeda tetapi memiliki hasil yang sama

In [73]:
df[(df['island'] == "Sumatera") & (df['unemployment'] < 5)].head()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera
6,Bengkulu,2668.9,166,434462,555949,403723,326656,4.91,1,Sumatera

Fungsi ```isin()``` dapat digunakan untuk memfilter kolom jika nilainya ditentukan dalam bentuk list/daftar. Misalnya, kami ingin menampilkan provinsi di Sumatera dan pulau Kalimantan yang memiliki tingkat pengangguran kurang dari 5

In [74]:
df[  (df['island'].isin(['Sumatera', 'Kalimantan'])) 
   & (df['unemployment'] < 5)
  ]

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
4,Jambi,1694.9,135,464204,556527,412871,349329,4.34,1,Sumatera
6,Bengkulu,2668.9,166,434462,555949,403723,326656,4.91,1,Sumatera
20,Kalimantan Tengah,2748.4,155,506106,549096,489011,361909,4.54,1,Kalimantan
21,Kalimantan Selatan,2509.6,166,510837,670407,440745,349861,4.92,2,Kalimantan

Untuk penyataan negasi atau __NOT__ menggunakan tanda '~'

In [75]:
df[  ~(df['island'].isin(['Sumatera', 'Kalimantan'])) 
   & (df['unemployment'] < 5)
  ].head()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
12,Jawa Tengah,1620.7,140,350517,468198,313724,277509,4.99,1,Jawa
13,DI Yogyakarta,2045.5,119,385061,697510,325188,297594,4.07,1,Jawa
14,Jawa Timur,2024.7,133,427218,604896,338325,306017,4.47,1,Jawa
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali
18,Nusa Tenggara Timur,1406.0,82,401053,473374,272347,176028,3.83,2,Nusa Tenggara

Hasil pernyataan diatas menunjukkan semua data yang __TIDAK berada di pulau Sumatera dan Kalimantan,__ dan memiliki __tingkat pengangguran kurang dari 5__

Jika pernyataan kondisi terlalu rumit, maka sebaiknya dibuat variable DataFrame baru sehingga menyederhanakan proses berikutnya

In [76]:
df2 = df[  ~(df['island'].isin(['Sumatera', 'Kalimantan']))
   & (df['unemployment'] < 5)
  ]
df2.sample(5)

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali
13,DI Yogyakarta,2045.5,119,385061,697510,325188,297594,4.07,1,Jawa
18,Nusa Tenggara Timur,1406.0,82,401053,473374,272347,176028,3.83,2,Nusa Tenggara
28,Gorontalo,870.6,76,400853,541711,287010,234180,4.65,2,Sulawesi
14,Jawa Timur,2024.7,133,427218,604896,338325,306017,4.47,1,Jawa

### __Mengurutkan Data__

Fungsi ```sort_values()``` digunakan untuk melakukan pengurutan data berdasarkan dengan kolom yang disebutkan mulai dari nilai terkecil. Perintah berikut untuk menampilkan data diurutkan berdasarkan kolom rainfall

In [77]:
df.sort_values('rainfall').head()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
25,Sulawesi Tengah,460.9,68,429317,629817,368439,293645,4.10,2,Sulawesi
28,Gorontalo,870.6,76,400853,541711,287010,234180,4.65,2,Sulawesi
31,Maluku Utara,913.4,127,465188,510105,404776,315800,6.05,3,Maluku
1,Sumatera Utara,975.9,105,416073,453609,413087,269407,6.71,1,Sumatera
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali

Atau menggunakan data yang telah difilter sebelumnya

In [79]:
df2.sort_values('rainfall').head(5)

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
25,Sulawesi Tengah,460.9,68,429317,629817,368439,293645,4.10,2,Sulawesi
28,Gorontalo,870.6,76,400853,541711,287010,234180,4.65,2,Sulawesi
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali
29,Sulawesi Barat,1167.9,93,367632,369746,321635,263154,3.35,2,Sulawesi
33,Papua,1265.9,168,666922,739704,403652,218261,3.99,3,Papua

Untuk mengurutkan data dimulai dari nilai terbesar, maka parameter __ascending__ diberi nilai __False__

In [81]:
# Mengurutkan kolom rainfall secara descending (dari yang terbesar)
df.sort_values('rainfall', ascending=False).head()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
2,Sumatera Barat,3548.0,185,509609,578890,447944,319143,6.89,1,Sumatera
26,Sulawesi Selatan,3382.0,155,436956,575266,312799,275628,5.95,2,Sulawesi
32,Papua Barat,2844.6,218,593203,676879,463880,420440,8.08,3,Papua
19,Kalimantan Barat,2757.7,215,473082,526121,405835,282118,5.15,1,Kalimantan
20,Kalimantan Tengah,2748.4,155,506106,549096,489011,361909,4.54,1,Kalimantan

Jika ingin mengurutkan data dengan menggunakan lebih dari satu kolom maka perlu ditentukan daftar nama kolom, misalkan mengurutkan berdasarkan kolom __rainfall__ dan __rainy_day__, dapat dilakukan seperti berikut

In [82]:
df.sort_values(['rainfall', 'rainy_day' ]).head()

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
25,Sulawesi Tengah,460.9,68,429317,629817,368439,293645,4.10,2,Sulawesi
28,Gorontalo,870.6,76,400853,541711,287010,234180,4.65,2,Sulawesi
31,Maluku Utara,913.4,127,465188,510105,404776,315800,6.05,3,Maluku
1,Sumatera Utara,975.9,105,416073,453609,413087,269407,6.71,1,Sumatera
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali

pada baris 3 dan 4 terlihat data memiliki nilai rainy_day yang tidak berurut, karena telah diurutkan berdasarkan rainfall terlebih dahulu

Setiap kolom juga dapat memiliki tipe pengurutannya masing-masing, misalkan __time_zone__ diurutkan secara __DESC__ dan __rainy_day__ secara __ASC__

In [83]:
df.sort_values(['time_zone', 'rainy_day'], ascending=[0, 1]).head(10)

,province,rainfall,rainy_day,expenses_food_urban,expenses_other_urban,expenses_food_rural,expense_other_rural,unemployment,time_zone,island
31,Maluku Utara,913.4,127,465188,510105,404776,315800,6.05,3,Maluku
30,Maluku,1987.2,167,486374,511825,378946,285648,9.93,3,Maluku
33,Papua,1265.9,168,666922,739704,403652,218261,3.99,3,Papua
32,Papua Barat,2844.6,218,593203,676879,463880,420440,8.08,3,Papua
25,Sulawesi Tengah,460.9,68,429317,629817,368439,293645,4.10,2,Sulawesi
28,Gorontalo,870.6,76,400853,541711,287010,234180,4.65,2,Sulawesi
18,Nusa Tenggara Timur,1406.0,82,401053,473374,272347,176028,3.83,2,Nusa Tenggara
17,Nusa Tenggara Barat,1147.9,91,373402,381980,341583,263291,5.69,2,Nusa Tenggara
29,Sulawesi Barat,1167.9,93,367632,369746,321635,263154,3.35,2,Sulawesi
16,Bali,1133.8,124,441921,737657,389091,441381,1.99,2,Bali

menampilkan hanya kolom __time_zone__, __rainy_day__, __province__, dan __island__

In [98]:
df3 = df.sort_values(['time_zone', 'rainy_day'], ascending=[0, 1])

df3[['time_zone','rainy_day','province','island']].head(10)

    time_zone  rainy_day             province         island
31          3        127         Maluku Utara         Maluku
30          3        167               Maluku         Maluku
33          3        168                Papua          Papua
32          3        218          Papua Barat          Papua
25          2         68      Sulawesi Tengah       Sulawesi
28          2         76            Gorontalo       Sulawesi
18          2         82  Nusa Tenggara Timur  Nusa Tenggara
17          2         91  Nusa Tenggara Barat  Nusa Tenggara
29          2         93       Sulawesi Barat       Sulawesi
16          2        124                 Bali           Bali

<a id="12"></a> 
## üí°Quiz Time

Soal 1 __Function & Method__:

Buatlah sebuah fungsi Python dengan nama greeting yang menerima satu parameter name, kemudian mencetak kalimat:

```"Hello, <name>! Welcome to the course."```

In [ ]:
# Tulis kode untuk soal Function Anda disini

Berikut adalah list nama peserta:

In [11]:
participants = ["Andi", "Budi", "Citra"]

Tambahkan nama "Dina" ke dalam list tersebut menggunakan method!

In [12]:
# Tulis kode untuk soal Method Anda disini

Soal 2 __Pandas & Numpy__:

Diberikan DataFrame berikut:

In [15]:
import pandas as pd

data = {
    'Name': ['Andi', 'Budi', 'Citra'],
    'Age': [23, 25, 22],
    'Score': [85, 90, 88]
}

df = pd.DataFrame(data)
print(df)

    Name  Age  Score
0   Andi   23     85
1   Budi   25     90
2  Citra   22     88

Tentukan rata-rata dari kolom Score menggunakan method ```mean()```!

In [16]:
# Tulis kode untuk soal Pandas Anda disini

['Andi', 'Budi', 'Citra', 'Dina']

Buatlah sebuah array NumPy 2 dimensi berukuran 3x3 yang berisi angka dari 1 sampai 9, kemudian tampilkan transpose dari array tersebut dengan menggunakan method numpy!

In [ ]:
# Tulis kode untuk soal Numpy Anda disini